let a = 5 + 5 * 3;
alert(a);
//выведется 20
a = 5 + 5 * 3 + 3;
alert(a);
//выведется 23
a = 8 / 2 + 2;
alert(a);
//выведется 6
a = 8 + 2 / 2;
alert(a);
//выведется 8
a = 8 / 2 * 2;
alert(a);
//выведется 8
a = 8 * 4 / 2 / 2;
alert(a);
//выведется 8
a = (2 + 3) * (2 + 3);
alert(a);
//выведется 25
a = (2 + 3) * 2 + 3;
alert(a);
// выведется 13
a = 2 * (2 + 4 * (3 + 1));
alert(a);
//выведется 48
a = 2 * 8 / 4;
alert(a);
//выведется 4
a = (2 * 8) / 4;
alert(a);
// выведется 4
a = 2 * (8 / 4);
alert(a);
// выведется 4