let a = '5' + '2';
alert(a);
// выведется 52
a = '5' + 2;
alert(a);
// выведется 52
a = 5 + '2';
alert(a);
// выведется 52
a = 5 + 2;
alert(a);
// выведется 7
a = '5' * '2';
alert(a);
// выведется 10
a = '5' - '2';
alert(a);
// выведется 3
a = '5' / '2';
alert(a);
// выведется 2.5
a = '5' % '2';
alert(a);
// выведется 1
a = '5s' * '2';
alert(a);
// выведется NaN
a = '5s' + '2';
alert(a);
//выведется 5s2
a = (-'5') + (-'2');
alert(a);
//выведется -7
a = '5' * 1 + '2' * 1;
alert(a);
// выведется 7
a = '5' * '1' + '2' * '1';
alert(a);
// выведется 7
a = '' + 3 + 1;
alert(a);
// выведется 31
